# FailedToBecomeNonParametric Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FailedToBecomeNonParametric Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Family failed to become non-parametric!
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedToBecomeNonParametric { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedToBecomeNonParametric As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedToBecomeNonParametric {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace